{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "balance_inquiry",
    "1": "greeting",
    "2": "help",
    "3": "loan_query",
    "4": "money_transfer",
    "5": "set_reminder"
  },
  "initializer_range": 0.02,
  "label2id": {
    "balance_inquiry": 0,
    "greeting": 1,
    "help": 2,
    "loan_query": 3,
    "money_transfer": 4,
    "set_reminder": 5
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.1",
  "vocab_size": 30522
}
